app/controllers/user_controller.rb

  def edit
    @pagetitle = 'Edit User Details'
    if params[:id]
    	@user = User.find(params[:id])
---
SELECT * FROM `users` WHERE (`users`.`id` IS NULL) LIMIT 1