app/controllers/user_controller.rb

INSERT INTO `users` (`encrypted_password`, `salt`, `created_at`, `updated_at`, `username`, `role`, `last_name`, `random_string`, `first_name`) VALUES('7ae8bf0513c97453523b8dd391650fc1ff88c68b', '-6104764480.0590622511085263', '2009-05-27 13:41:51', '2009-05-27 13:41:51', 'ceekays', 'admin', 'Kachale', NULL, 'Edmond')
---
  def new
    @pagetitle = 'Create New User'

		@user = User.new(params[:user])

    if request.post?
      @user.role = Role.find_by_role(params[:user][:role]).id
      if (@user.save)

SELECT * FROM `users` WHERE (`users`.`id` IS NULL) LIMIT 1
---
  def list
        @tasks=[
      ["Item Management",main_path(:items)],
      ["User Administration",main_path(:users)],
      ["Main Dashboard",main_path(:index)]
    ]

    @pagetitle = 'User Details'
    @all_users = User.find(:all)

SELECT `users`.id FROM `users` WHERE (`users`.`username` = BINARY 'pinto' AND `users`.id <> 3) LIMIT 1
UPDATE `users` SET `updated_at` = '2009-05-28 09:46:31', `salt` = 'lKDe0ugiYksJz4t1mkLDv1ZSkQcZkZAOvhGoAJCL', `role` = 'admin', `encrypted_password` = 'e0bc2281bcb13d39bd604aba61abd8f40cfd9fb3' WHERE `id` = 6
---
  def edit
    @pagetitle = 'Edit User Details'
    if params[:id]
    @user = User.find_by_username(params[:id])
    if request.post? &&  @user
      if @user.update_attributes(params[:user])