allfiles/app/controllers/user_controller.rb

  def new
    @pagetitle = 'Create New User'
    @user = User.new(params[:user])
    if request.post? && @user.save
---
INSERT INTO `users` (`salt`, `created_at`, `updated_at`, `username`, `role`, `last_name`, `password`, `first_name`) VALUES(NULL, '2009-05-19 10:09:55', '2009-05-19 10:09:55', 'ceekays', 'admin', 'kachale', 'shalom', 'edmond')

  def list
    @pagetitle = 'User Details'
    @all_users = User.find(:all)
---
SELECT * FROM `users` WHERE (`users`.`id` = 2)

  def edit
    @pagetitle = 'Edit User Details'
    @user = User.find(params[:id])
    if request.post? &&  @user
      if @user.update_attributes(params[:user])
---
SELECT * FROM `users` WHERE (`users`.`id` IS NULL) LIMIT 1
UPDATE `users` SET `updated_at` = '2009-05-19 16:27:50', `role` = 'bcb', `last_name` = 'nnx', `first_name` = 'dbdbd', `password` = 'sa' WHERE `id` = 3